#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "3fd9d8e246da48df265a2b56c6a6a214" -> "7a7f7928b97bff2c8e85ab16bee3aa0f"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "f98d32ef9e1e209a481def328949afc3" -> "1df7dbddb19817f2756e6afcd8688a46"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "11f935a16b96181b5f1d60b533a5244e" -> "0312120d6d29f4191e04c4067c12772f"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "8dfbde83d9bf9635cc2193603b784e20" -> "c8882819e0459de2b22e69ccd4e7121a"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "a59a67f4f6b68dc1f16dc51d4d190c73" -> "ee4028d362781e241a9913bc7e9a1625"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "dfd74caf97dd029a0271a1d87e0a5334" -> "25fb620a44f2c28cb16e3cb1799080e1"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "cbf1eec6057e6d8b46c230cd1e943655" -> "0dd88019637dcc131ff6ca49256f7e85"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "87752ff805b25a46eeb2bbc23a8838ca" -> "53efeac0fb64a790b034bf7fe3aaf43c"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "0f9a2e52a579c7b07c08a12e9a7265d2" -> "04b90d40fe1c0872d80d11fe680473b0"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "f45863c38e435d983abec4a4d679a2a8" -> "f08324418b28c7cd2bb0e73acd5eaddc"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "3f2109d6d262256255a07a6af1de532d" -> "338e3b33c6f090efc3d13de12b196bc3"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "6e9f730a70967c6322be08b4426a76e1" -> "6442b7a92818bac4fb5a22d9ed7b7695"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "c167a9068e55f5c918a34a973de0a1ee" -> "f162e0e4db009490e9307d33d8d5cadc"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "bec63d2b002c7a5d40a5f63854535c1b" -> "118f3c630f75f940001829dedfeee84b"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "c9bb8b943ba0395ac02e8af4007400bb" -> "151f4aceb3206256c50fb0443c8685bb"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "34a83bc43fc9bf85beff704b890b544b" -> "552053b0d7370f15afbe4f3fdb2a42ec"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "f3c9c0f610f9b6930eca6932ac507fde" -> "38e1f8d5a12e08ef767073442ee00411"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "95c0c6db0db31b750b5f63a71a1dc0da" -> "35d921559d58d3c4a8a4cf8cf270b8b5"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "b85092f35e25bec659083eadbc29afed" -> "981b0e14646e5e12e57c439275a316c1"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "f41897f87448f72dfe418df6dbbbb62c" -> "76e4e02da3ec6456cb3bb2160f692a96"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "825ebda657d1f5f435b82b1df4bfb47c" -> "df0c8285ebb42853ff9e63b58bb93641"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "841a340e2969777842f6bcf9ae1909a6" -> "4fd2e8c459f7a92fe0c4092e452b8022"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "d4dc24a982673669115af458c04db206" -> "16f4effb80514b84c49ce6c8a5f80e8f"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "64f56bb13e451ce4d349bccaf6a996e4" -> "d066ac83412a10eba0426df4d859348b"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "6850a38fab0a26a248459c42e76206ca" -> "1de1e4e7c61015c34f4cbf855062d620"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "0ed216389cc49084a9b9926be4cab436" -> "2a04abf36aca6ebe866cb6cfe50c1010"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "a32a014813b70da72dc073aac79413cc" -> "ee32e217446e98158e3adda26072ca92"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7e2a84615c2f77e3e20248495aba237a" -> "3c9f1630a76cbea951caae0ddb311cf5"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "4d9002d1db480f54a67e19e3cf69aeec" -> "fd5bbb0b0a507ad40c52dc08b290a95b"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "048f2fa6c2eaebe03e456125336380da" -> "75e2ecaf9e9f9e950a00b10d1bb86296"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "942c10cc404adb0f22c8cc3fe44dc9bf" -> "17b88e8101efe75307140dd79dfdf9e6"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "97549c484694aa579fe8a864459cec7e" -> "6c53d541310ddf75da9737a5345315f6"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "e2a5ec3983efa9ac1572e4032263dd77" -> "0fcb0f24bc633345697cc3b26f631022"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "6bcacef4498c40b184b74ccda2deaf22" -> "ada9c53d900c6de0c0d72677412d8b1f"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "e88b19c2499f6ef1a97a722c66f83d42" -> "4b18ec400244cac6a06b6015c69f7275"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "d3fa3dd06a94784d79906f688d8c97a1" -> "56694bb9c2df03cb4d3570049ed5a6cf"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "26d5f2876d9575af3dfbe21efb3c6bfb" -> "1e18c7d3cc1a04b85fc1a53869591a4e"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "394bfb21615993dbbae624a27baec5e4" -> "07194d11ffe2bb38b611521f6cb2a7aa"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "eed8fd2ba6e0b0964f5468cd349864a1" -> "3a72416edf3a785321f80b55da728ca1"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "182e3a90e15667ab0466b3faa8180bf7" -> "0ff927c9fafb28d4539e4b3041c6d0a9"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "270478b4340359e7c2772c85809e55fe" -> "04d25686699203cad38aa4148c9270da"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "48f99cf2abe811a0a9146c5a4cd59618" -> "812f4e05583b5cb3bfde67601d839107"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4779926d16b7cf2ef5ea6fc6f221d8a6" -> "493a307f8390bd64b4a502af8d75e81c"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.codebuild.aws_codebuild_source_credential.git_credential must be replaced
-/+ resource "aws_codebuild_source_credential" "git_credential" {
      ~ arn         = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ id          = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ token       = (sensitive value) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "kpGr/mwjOLYX0LQRqh2gNgdS1rB+PQND0Jy15RpC+jc=" -> "YX/0g/fnxEpwCJpmmkmOG6bMSqevdX8UjuNEKAOKoEQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "Vs7SjePrS8gY8XSNu+lYHctfGM5sAYDjKdHTRw5ufsM=" -> "rMFezDWX3wDebUkWYLZVahj7/b5ivyfWR55XUqm5/jM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "VcF1T8MPsERT7W10lMu5WTVx2BEqNfuIZVNoRwZkvhg=" -> "7Quk1rTp7+ort8qZm3N+G8tw1AAy+yLhJOLfiRyUOBQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "S6nGKT7DuSNL9X0QvZbGqL6061WKlPFxmqZPSqm3UQ0=" -> "Zd5xqf9VxI8ZiQOB3AwuLzM4d8ztWXJt2aRy4jPc+ig="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "gZn3mNzqb+Z2Ulnu/AaH0nd0QhDFANjFDuB3Wkk+SnA=" -> "MF+/t2sOm2yGam+ugd8ARK/v8OzcYmJzcOt/P3v4mLQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "QBARFicV8aMsMejbusiB9tG4ss0eGJ33eT7u6h6oerc=" -> "XisRSub4uEWkSzkuVC/yDnOFSTvlVthxn/Hcj7rIZYU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "LuVHQbNLqw5R0luyu2wMatebbGD8k41A4YiCLoGdIsU=" -> "a5rif9Cdjdr3l6p6PxXsNnRfTsGDV7sefQGMRFOLenY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "RjbQ7qmaPGGxzia459HD/nhp6oKglMLdMxVRIiOZm1g=" -> "R0JUrbksQxy4CXmPafvskeA301LRXlPQiq3tik5vhCM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "eUHMr65V/2Q7ICHoHVWmrmof2r2xrhDscnxG6GjboPs=" -> "01JgWICNuAOeoMv7cA1ukjsXUb++1JreQHsfYS7vKdk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "/5+K7GTvHKWBGKLRKjQF+XA3DPHe6mqPH4lVOkk9Ai8=" -> "f0g+jfvnh4nhixengVAM+glT576z2b2qbV/x31wv5OU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "s0s/xS64v+7MfGSHE8NBzVZELpRogJkYgW2Ly3SXaOY=" -> "jjAhLNQpn1oPc1thsbb9Q27/Ji1oj6CkdHFXYBtZT6w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "WvvxCG2MBHXb58Qdjy3O+kB4eV67Dyn2nZAbG/dLjaU=" -> "bfvDRscL6I+fu+P/8YSGNN1hSXsMQOimJI43DFffw7M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "WfSX6RJaW4ENU6xP/P/gpy4yRv6ospmLEqrdJxdxFZI=" -> "U0ZrxOVffEJVvIWz21/3f3rv3eijNfmwqcURBxlN0ek="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "4AkT9JE2Xe+AMDnHrwdGCddqk9LO+yhLfETqOAqBFV0=" -> "Tp8He+C15mCFmSc0kP7IzxdpoStWMeUff7RsjbtgEfk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "hMSKal/wJ1XwkUbECOGvT56THAbHdXqVO3g8n4ZxNVM=" -> "QvTC/pcBqfQ6gQpgy7WYItexDk0L1wuUuhmfGrVyP+A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "cEfGDPexcle4umaBCmkzzvwMPWE5Hxg4m7Ub8tpbM1k=" -> "wYsVuCf7pKP4pQV6NsTvjFyDhRJPgsCVLWUX2eZdebg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hn9if487roM4UaqV+Atnyxi683F/qi/PC3PFLux90DU=" -> "5Crd3+YM7VF67Bhbg1X9NBymseibhzI5SX9OD2EekE4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-01T20:43:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "CS/UZkEjhXDDR+YkZmTcn3k0NOLU6Ncp+IZUHMdCYkM=" -> "xn5C/0+CNRgW3eeiG6k58gtWco9YQLzQqaQg5Zf3uWM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "3Ccu5198aKGRv5n99K6tb51vB6VfGP6r4GPbsqBBhg8=" -> "J4DnaoBEUOsX2KPjWPpCA4FR6TccRkhBFDK2D9b8FkY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "iWRK/WvqG7zteJa3TGBaYf/6Uc/MJDjdONKMUW7UEVg=" -> "Wk7gyRixMe+VdRt8xA+bWzdk1KAFax9nDpHCG1IFU0E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "3DxJQse/usODcSM62/ng7/NDSTMAXSKE6t8EV84IG7A=" -> "xD9Z4m4S0NzJF2zt9TUkLGrOyDnYmpYKSnaPNinaDfE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "nIxmvcsGnEQj/3JikzTho5uvSolB1kgGHBr6vnkvRSk=" -> "IRY2OmjaFm8JTXd84+u5o7Ifc4NlCGhAQs2nkyNWgqc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "o61Qn/k1HZpmwEXNfVxVVXZ9y5CNoH8+hND8nyR8xIc=" -> "443gzl0M//V4omN/x7GYXB0T4AY1Hq4S4EoRLYA7YJU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "uRg1n9vvr+qzEUyGMLU2DlRWURCVCHQPLLQgKVfefkQ=" -> "Jt8fM6MOTCleS2DhXOSF2GgfQ9XDGISPdjXfqetbaNs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "BxE/oLkR7+ssQWkKuoCZhyjdQj2zXHgXHce6vWwcv4k=" -> "YittIn3yrhV5Pd+9n0HylEB9lzqjuyKWkI5dqU1NQxc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "daKXo+d0SnGXXJELltf5+0KF9qu3Pi5xAJyVPrPpy0o=" -> "UxOEDcf0f2xk4XyqafyuMpCv/e26GSjbxWN61+qk64o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "WVVP6bbzFbybG/b5c8xfc1Hz10S0mcAFDdybPn3SJU8=" -> "LC7/abYVKuy6cqeh7HwSq8W41yFz1lD0Lg8wj/wAIgU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "FtFycq+75wH7WmejM0EfQg7UuSbTutqXJwsvBl+foKY=" -> "Tlf0bThnZGLDEaLNhw3+4El4RU+KuJhdJBmptCzz/hw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "DhVn4RBj9XpQ3oHcKcD+yYvhXpDQBRlIBGf2fxWChuY=" -> "fTqmfTvS1kXZI5D700LQlqQ8yE09dTCgp0WDcbU7Bqg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "8jMpFs8EvfaQMhLwOp/nDbcjT5Bx//4ayLRX5ZpmI2I=" -> "fFYzEVmXCn+rcV0AC5UEE9GfEsiz9b5tnqr699TwUCs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "nkSUJZg+ARrrCv1yFQ20VJk1pmcxOEb4UOuo3Hyyhc4=" -> "whH0KQSp70gQlcB4LGe4QaTiNGRJZIO+oXx3nW8cnXg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "gDKR3dicxdeoZRaod9aXDiIjmqpD9I2qxiQkn0H82MQ=" -> "zA+roBjW09HlTcOvBttfF6MqJPiTZ5t4Qmh7NvwYLqM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "mYWGtyI5Lqv3jrUzu/sr+7dWU8ZLr5/4KcXrgxV64Iw=" -> "83UYtGzjNw2wqxkskQg40y4mu3NJJAtdcJlN6DJh+v8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "e6eVu1PC03Kv1ti843nF7zO70gQSkgR0LE5s6g3azmU=" -> "dpLEPNPe8KKKewr+DG0eKtivRsZFvQbWMyHhQTm1mZY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "luU1ZGPaN9Hf9KTPtentAC5C9f2eyqaA1kTiN7m9N1s=" -> "l2djHVOmq800fHJG5GjH52HotUoo4SBScZjdUUoHrx0="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "j1aYXpmP9J12jikw2d0hF3R4/CC+t42xQ/+spuvQXLI=" -> "fzbft8WH2G7sUTSaSVePBSMKdcZvm43ZLqqlYWKjaXE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "lE5qhPbfP0aBmYZHtLGUszigfzXAWryafFEU6CZm8eo=" -> "XCywXlCJ/cbul2/f3JBINs9zkGBiePiqhqQ1Ly26TOc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "LCDdX0VpXrfCDv7lmh9iFHtr5/18DIrngpiNukwwv18=" -> "MNg0F1ZLnBxainLd/1yDVD+5NxFKrNddMeoik3NhgD4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "RI9iFlD471X1/y3qRpSAHEBTEyTCyVFD9y7ucpdt+2I=" -> "1k770mS5Rg7sUKphxLjrJRx/3l+RLi2bUCsHhReUs8c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "j0CwaifjbZS5bozE7Bt01THRus6golSg3MrNam7at6I=" -> "efI4KAt4p9kgEciafzM+YggVKeJs+V5ML5axPTC+nSc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "gsZVR5KW35jFJMuJtHrW6fKkct6IQRmQNl/taBmM2LQ=" -> "5I1dj5Boy2zKksgpdSNkHNdTt08DKYv/Qb+5F0Mm1zs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "7MuPFDFN6Ic8GPoxF88DfO9O1To1XufVVd3FV55Ld8k=" -> "fAhPxgeTlIoSIHnR67JaR1hUwju3Nu4QAQvNUBhIZhU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-31T22:46:45Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "xy4ll8" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-31T22:46:39Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-31T22:49:20Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 87 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*